# 4. Запитайте два цілих числа та виведіть:
# a. Їхню суму
# b. Їхня різниця
# c. результат множення
# d. Результат поділу першого на друге
# e. Залишок від поділу першого на друге
# f. True, якщо перше число більше або дорівнює другому, інакше False

# немає обробки ділення на 0

a = int(input("Введіть перше число:   "))
b = int(input("Введіть друге число:   "))
print(f"a + b = ", a + b)
print(f"a - b = ", a - b)
print(f"a * b = ", a * b)
print(f"a / b = ", a/b if b != 0 else "Помилка ділення")
print(f"a % b = ", a%b if b != 0 else "Помилка ділення")
print(f"a>=b:  ", a>=b)
