# 3. Як вхідні дані візьмемо ціле число; Це число від 101 до 999, а його остання цифра не дорівнює нулю.
# Виведіть число, що складається з чисел першого у зворотньому порядку.
# Наприклад: 256 → 652.

a = input("Введіть ціле число в діапазоні від 101 до 999, але остання цифра не має бути нуль:   ")

if a.isdigit():
    b = int(a)
    if 101<=b<=999 and b % 10 != 0:
        c = str(b)
        d = c[::-1]
        print(d)
    else:
        print("Пу пу пу, ми так не домовлялися")
else:
    print("Пу пу пу, ми так не домовлялися, це навіть не число")