# # 2. Запросіть ціле число і виведіть True, якщо це парне число діапазоні від 100 до 999, інакше - «False».
#  Рішення 2 завдання можна записати лаконічніше:
#  num = int(input("Введіть ціле число: "))
#  print(num >= 100 and num <= 999 and num % 2 == 0)


# a = int(input("Введіть ціле число в діапазоні від 100 до 999:   "))
#
# if 100<a<999:
#     if a % 2 == 0:
#         print("Число парне")
#     else:
#         print("Число непарне")
# else:
#     print("Пу пу пу, ми так не домовлялися")

a = int(input("Введіть ціле число:   "))

print(a >= 100 and a <= 999 and a % 2 == 0)
